MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMR35J16B/mcu.h
/*
 * \brief CMSIS includes
 */
// Note: Changed for MikroE implementation.
// #include "core_cm0plus.h"
#if defined USE_CMSIS_INIT
// Note: Changed for MikroE implementation.
// #include "system_samr35.h"
#endif /* USE_CMSIS_INIT */

/** \defgroup SAMR35J16B_api Peripheral Software API
 *  @{
 */

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAMR35J16B                        */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/aes.h"
#include "component/ccl.h"
#include "component/dmac.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/fuses.h"
#include "component/gclk.h"
#include "component/mclk.h"
#include "component/mtb.h"
#include "component/nvmctrl.h"
#include "component/osc32kctrl.h"
#include "component/oscctrl.h"
#include "component/pac.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/ptc.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/trng.h"
#include "component/wdt.h"
/** @}  end of Peripheral Software API */

/* ************************************************************************** */
/*   INSTANCE DEFINITIONS FOR SAMR35J16B */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adc.h"
#include "instance/aes.h"
#include "instance/ccl.h"
#include "instance/dmac.h"
#include "instance/dsu.h"
#include "instance/eic.h"
#include "instance/evsys.h"
#include "instance/fuses.h"
#include "instance/gclk.h"
#include "instance/mclk.h"
#include "instance/mtb.h"
#include "instance/nvmctrl.h"
#include "instance/osc32kctrl.h"
#include "instance/oscctrl.h"
#include "instance/pac.h"
#include "instance/pm.h"
#include "instance/port.h"
#include "instance/ptc.h"
#include "instance/rstc.h"
#include "instance/rtc.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sercom3.h"
#include "instance/sercom4.h"
#include "instance/sercom5.h"
#include "instance/supc.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/tc3.h"
#include "instance/tc4.h"
#include "instance/tcc0.h"
#include "instance/tcc1.h"
#include "instance/tcc2.h"
#include "instance/trng.h"
#include "instance/wdt.h"

/** \addtogroup SAMR35J16B_id Peripheral Ids Definitions
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR SAMR35J16B                                  */
/* ************************************************************************** */
#define ID_PM            (  0) /**< \brief Power Manager (PM) */
#define ID_MCLK          (  1) /**< \brief Main Clock (MCLK) */
#define ID_RSTC          (  2) /**< \brief Reset Controller (RSTC) */
#define ID_OSCCTRL       (  3) /**< \brief Oscillators Control (OSCCTRL) */
#define ID_OSC32KCTRL    (  4) /**< \brief 32k Oscillators Control (OSC32KCTRL) */
#define ID_SUPC          (  5) /**< \brief Supply Controller (SUPC) */
#define ID_GCLK          (  6) /**< \brief Generic Clock Generator (GCLK) */
#define ID_WDT           (  7) /**< \brief Watchdog Timer (WDT) */
#define ID_RTC           (  8) /**< \brief Real-Time Counter (RTC) */
#define ID_EIC           (  9) /**< \brief External Interrupt Controller (EIC) */
#define ID_PORT          ( 10) /**< \brief Port Module (PORT) */
#define ID_DSU           ( 33) /**< \brief Device Service Unit (DSU) */
#define ID_NVMCTRL       ( 34) /**< \brief Non-Volatile Memory Controller (NVMCTRL) */
#define ID_MTB           ( 35) /**< \brief Cortex-M0+ Micro-Trace Buffer (MTB) */
#define ID_SERCOM0       ( 64) /**< \brief Serial Communication Interface (SERCOM0) */
#define ID_SERCOM1       ( 65) /**< \brief Serial Communication Interface (SERCOM1) */
#define ID_SERCOM2       ( 66) /**< \brief Serial Communication Interface (SERCOM2) */
#define ID_SERCOM3       ( 67) /**< \brief Serial Communication Interface (SERCOM3) */
#define ID_SERCOM4       ( 68) /**< \brief Serial Communication Interface (SERCOM4) */
#define ID_TCC0          ( 69) /**< \brief Timer Counter Control (TCC0) */
#define ID_TCC1          ( 70) /**< \brief Timer Counter Control (TCC1) */
#define ID_TCC2          ( 71) /**< \brief Timer Counter Control (TCC2) */
#define ID_TC0           ( 72) /**< \brief Basic Timer Counter (TC0) */
#define ID_TC1           ( 73) /**< \brief Basic Timer Counter (TC1) */
#define ID_TC2           ( 74) /**< \brief Basic Timer Counter (TC2) */
#define ID_TC3           ( 75) /**< \brief Basic Timer Counter (TC3) */
#define ID_AES           ( 77) /**< \brief Advanced Encryption Standard (AES) */
#define ID_TRNG          ( 78) /**< \brief True Random Generator (TRNG) */
#define ID_EVSYS         ( 96) /**< \brief Event System Interface (EVSYS) */
#define ID_SERCOM5       ( 97) /**< \brief Serial Communication Interface (SERCOM5) */
#define ID_TC4           ( 98) /**< \brief Basic Timer Counter (TC4) */
#define ID_ADC           ( 99) /**< \brief Analog Digital Converter (ADC) */
#define ID_AC            (100) /**< \brief Analog Comparators (AC) */
#define ID_PTC           (101) /**< \brief Peripheral Touch Controller (PTC) */
#define ID_CCL           (103) /**< \brief Configurable Custom Logic (CCL) */
#define ID_PAC           (128) /**< \brief Peripheral Access Controller (PAC) */
#define ID_DMAC          (129) /**< \brief Direct Memory Access Controller (DMAC) */

#define ID_PERIPH_MAX    (129) /**< \brief Number of peripheral IDs */
/** @}  end of Peripheral Ids Definitions */

/** \addtogroup SAMR35J16B_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR SAMR35J16B                    */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x43001000)                 /**< \brief AC Registers Address         */
#define ADC_REGS                         ((adc_registers_t*)0x43000c00)                /**< \brief ADC Registers Address        */
#define AES_REGS                         ((aes_registers_t*)0x42003400)                /**< \brief AES Registers Address        */
#define CCL_REGS                         ((ccl_registers_t*)0x43001c00)                /**< \brief CCL Registers Address        */
#define DMAC_REGS                        ((dmac_registers_t*)0x44000400)               /**< \brief DMAC Registers Address       */
#define DSU_REGS                         ((dsu_registers_t*)0x41002000)                /**< \brief DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40002400)                /**< \brief EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x43000000)              /**< \brief EVSYS Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x40001800)               /**< \brief GCLK Registers Address       */
#define MCLK_REGS                        ((mclk_registers_t*)0x40000400)               /**< \brief MCLK Registers Address       */
#define MTB_REGS                         ((mtb_registers_t*)0x41006000)                /**< \brief MTB Registers Address        */
#define NVMCTRL_REGS                     ((nvmctrl_registers_t*)0x41004000)            /**< \brief NVMCTRL Registers Address    */
#define OTP5_FUSES_REGS                  ((fuses_otp5_fuses_registers_t*)0x00806020)   /**< \brief FUSES Registers Address      */
#define TEMP_LOG_FUSES_REGS              ((fuses_temp_log_fuses_registers_t*)0x00806030) /**< \brief FUSES Registers Address      */
#define USER_FUSES_REGS                  ((fuses_user_fuses_registers_t*)0x00804000)   /**< \brief FUSES Registers Address      */
#define OSCCTRL_REGS                     ((oscctrl_registers_t*)0x40000c00)            /**< \brief OSCCTRL Registers Address    */
#define OSC32KCTRL_REGS                  ((osc32kctrl_registers_t*)0x40001000)         /**< \brief OSC32KCTRL Registers Address */
#define PAC_REGS                         ((pac_registers_t*)0x44000000)                /**< \brief PAC Registers Address        */
#define PM_REGS                          ((pm_registers_t*)0x40000000)                 /**< \brief PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x40002800)               /**< \brief PORT Registers Address       */
#define PORT_IOBUS_REGS                  ((port_registers_t*)0x60000000)               /**< \brief PORT Registers Address       */
#define PTC_REGS                         ((ptc_registers_t*)0x43001400)                /**< \brief PTC Registers Address        */
#define RSTC_REGS                        ((rstc_registers_t*)0x40000800)               /**< \brief RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x40002000)                /**< \brief RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x42000000)             /**< \brief SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x42000400)             /**< \brief SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x42000800)             /**< \brief SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x42000c00)             /**< \brief SERCOM3 Registers Address    */
#define SERCOM4_REGS                     ((sercom_registers_t*)0x42001000)             /**< \brief SERCOM4 Registers Address    */
#define SERCOM5_REGS                     ((sercom_registers_t*)0x43000400)             /**< \brief SERCOM5 Registers Address    */
#define SUPC_REGS                        ((supc_registers_t*)0x40001400)               /**< \brief SUPC Registers Address       */
#define TC0_REGS                         ((tc_registers_t*)0x42002000)                 /**< \brief TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x42002400)                 /**< \brief TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x42002800)                 /**< \brief TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x42002c00)                 /**< \brief TC3 Registers Address        */
#define TC4_REGS                         ((tc_registers_t*)0x43000800)                 /**< \brief TC4 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x42001400)                /**< \brief TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x42001800)                /**< \brief TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x42001c00)                /**< \brief TCC2 Registers Address       */
#define TRNG_REGS                        ((trng_registers_t*)0x42003800)               /**< \brief TRNG Registers Address       */
#define WDT_REGS                         ((wdt_registers_t*)0x40001c00)                /**< \brief WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup SAMR35J16B_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAMR35J16B                                  */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UL_(0x43001000)                              /* AC Base Address */
#define ADC_BASE_ADDRESS                 _UL_(0x43000c00)                              /* ADC Base Address */
#define AES_BASE_ADDRESS                 _UL_(0x42003400)                              /* AES Base Address */
#define CCL_BASE_ADDRESS                 _UL_(0x43001c00)                              /* CCL Base Address */
#define DMAC_BASE_ADDRESS                _UL_(0x44000400)                              /* DMAC Base Address */
#define DSU_BASE_ADDRESS                 _UL_(0x41002000)                              /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UL_(0x40002400)                              /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UL_(0x43000000)                              /* EVSYS Base Address */
#define GCLK_BASE_ADDRESS                _UL_(0x40001800)                              /* GCLK Base Address */
#define MCLK_BASE_ADDRESS                _UL_(0x40000400)                              /* MCLK Base Address */
#define MTB_BASE_ADDRESS                 _UL_(0x41006000)                              /* MTB Base Address */
#define NVMCTRL_BASE_ADDRESS             _UL_(0x41004000)                              /* NVMCTRL Base Address */
#define OTP5_FUSES_BASE_ADDRESS          _UL_(0x00806020)                              /* FUSES Base Address */
#define TEMP_LOG_FUSES_BASE_ADDRESS      _UL_(0x00806030)                              /* FUSES Base Address */
#define USER_FUSES_BASE_ADDRESS          _UL_(0x00804000)                              /* FUSES Base Address */
#define OSCCTRL_BASE_ADDRESS             _UL_(0x40000c00)                              /* OSCCTRL Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UL_(0x40001000)                              /* OSC32KCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UL_(0x44000000)                              /* PAC Base Address */
#define PM_BASE_ADDRESS                  _UL_(0x40000000)                              /* PM Base Address */
#define PORT_BASE_ADDRESS                _UL_(0x40002800)                              /* PORT Base Address */
#define PORT_IOBUS_BASE_ADDRESS          _UL_(0x60000000)                              /* PORT Base Address */
#define PTC_BASE_ADDRESS                 _UL_(0x43001400)                              /* PTC Base Address */
#define RSTC_BASE_ADDRESS                _UL_(0x40000800)                              /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UL_(0x40002000)                              /* RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UL_(0x42000000)                              /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UL_(0x42000400)                              /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UL_(0x42000800)                              /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UL_(0x42000c00)                              /* SERCOM3 Base Address */
#define SERCOM4_BASE_ADDRESS             _UL_(0x42001000)                              /* SERCOM4 Base Address */
#define SERCOM5_BASE_ADDRESS             _UL_(0x43000400)                              /* SERCOM5 Base Address */
#define SUPC_BASE_ADDRESS                _UL_(0x40001400)                              /* SUPC Base Address */
#define TC0_BASE_ADDRESS                 _UL_(0x42002000)                              /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UL_(0x42002400)                              /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UL_(0x42002800)                              /* TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UL_(0x42002c00)                              /* TC3 Base Address */
#define TC4_BASE_ADDRESS                 _UL_(0x43000800)                              /* TC4 Base Address */
#define TCC0_BASE_ADDRESS                _UL_(0x42001400)                              /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UL_(0x42001800)                              /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UL_(0x42001c00)                              /* TCC2 Base Address */
#define TRNG_BASE_ADDRESS                _UL_(0x42003800)                              /* TRNG Base Address */
#define WDT_BASE_ADDRESS                 _UL_(0x40001c00)                              /* WDT Base Address */
/** @}  end of Peripheral Base Address Definitions */

